Repository: LittleSixNine/PhotoTrail
Catalog: Sources/PhotoTrail/Localizable.xcstrings
Source language: en
Languages: es, ja, ko, pt_br, zh_hans, zh_hant

# 清除转换缓存…
source: Clear conversion cache…
es: Borrar caché de conversión…
ja: 変換キャッシュを消去…
ko: 변환 캐시 지우기…
pt_br: Limpar cache de conversão…
zh_hans: 清除转换缓存…
zh_hant: 清除轉換快取…

# 清除轨迹转换缓存？
source: Clear track conversion cache?
es: ¿Borrar la caché de conversión de recorridos?
ja: 軌跡の変換キャッシュを消去しますか？
ko: 트랙 변환 캐시를 지울까요?
pt_br: Limpar o cache de conversão de trajetos?
zh_hans: 清除轨迹转换缓存？
zh_hant: 清除軌跡轉換快取？

# 清除转换缓存
source: Clear conversion cache
es: Borrar caché de conversión
ja: 変換キャッシュを消去
ko: 변환 캐시 지우기
pt_br: Limpar cache de conversão
zh_hans: 清除转换缓存
zh_hant: 清除轉換快取

# 仅清除高德坐标转换结果，保留原轨迹文件和历史记录。
source: Clears only AMap coordinate conversions. Original track files and history are kept.
es: Solo borra conversiones de coordenadas de AMap. Conserva los archivos originales y el historial.
ja: 高徳の座標変換結果のみを消去します。元の軌跡ファイルと履歴は保持されます。
ko: 가오더 좌표 변환 결과만 지웁니다. 원본 트랙 파일과 기록은 유지됩니다.
pt_br: Limpa apenas as conversões de coordenadas do AMap. Preserva os arquivos originais e o histórico.
zh_hans: 仅清除高德坐标转换结果，保留原轨迹文件和历史记录。
zh_hant: 僅清除高德座標轉換結果，保留原軌跡檔案和歷史記錄。

# 原轨迹文件和历史记录会保留；高德轨迹在重新显示或刷新时需要再次转换。
source: Original track files and history are kept. AMap tracks need conversion again when shown or refreshed.
es: Se conservan los archivos originales y el historial. Los recorridos de AMap se convierten de nuevo al mostrarlos o actualizarlos.
ja: 元の軌跡ファイルと履歴は保持されます。高徳の軌跡は再表示または更新時に再変換が必要です。
ko: 원본 트랙 파일과 기록은 유지됩니다. 가오더 트랙은 다시 표시하거나 새로 고칠 때 재변환해야 합니다.
pt_br: Os arquivos originais e o histórico são preservados. Os trajetos do AMap precisam de nova conversão ao serem exibidos ou atualizados.
zh_hans: 原轨迹文件和历史记录会保留；高德轨迹在重新显示或刷新时需要再次转换。
zh_hant: 原軌跡檔案和歷史記錄會保留；高德軌跡在重新顯示或重新整理時需要再次轉換。

# 转换缓存已清除。
source: Conversion cache cleared.
es: Caché de conversión borrada.
ja: 変換キャッシュを消去しました。
ko: 변환 캐시를 지웠습니다.
pt_br: Cache de conversão limpo.
zh_hans: 转换缓存已清除。
zh_hant: 轉換快取已清除。

# 转换缓存清除失败，原数据已保留。
source: Could not clear the conversion cache. Existing data is kept.
es: No se pudo borrar la caché de conversión. Se conservaron los datos.
ja: 変換キャッシュを消去できませんでした。既存のデータは保持されています。
ko: 변환 캐시를 지우지 못했습니다. 기존 데이터는 유지됩니다.
pt_br: Não foi possível limpar o cache de conversão. Os dados foram preservados.
zh_hans: 转换缓存清除失败，原数据已保留。
zh_hant: 轉換快取清除失敗，原資料已保留。

# 恢复默认
source: Restore defaults
es: Restaurar valores predeterminados
ja: 既定値に戻す
ko: 기본값 복원
pt_br: Restaurar padrões
zh_hans: 恢复默认
zh_hant: 恢復預設

# 步骤结果
source: Step result
es: Resultado del paso
ja: ステップ結果
ko: 단계 결과
pt_br: Resultado da etapa
zh_hans: 步骤结果
zh_hant: 步驟結果

# 选择操作以查看
source: Select an operation to view
es: Selecciona una operación para ver
ja: 操作を選択して表示
ko: 작업을 선택하여 보기
pt_br: Selecione uma operação para ver
zh_hans: 选择操作以查看
zh_hant: 選擇操作以查看

# 取消操作选择
source: Deselect operation
es: Deseleccionar operación
ja: 操作の選択を解除
ko: 작업 선택 해제
pt_br: Desmarcar operação
zh_hans: 取消操作选择
zh_hant: 取消操作選擇

# 保存重命名方案
source: Save rename scheme
es: Guardar esquema de renombrado
ja: 名前変更プランを保存
ko: 이름 변경 방식 저장
pt_br: Salvar esquema de renomeação
zh_hans: 保存重命名方案
zh_hant: 保存重命名方案

# 方案名称
source: Scheme name
es: Nombre del esquema
ja: プラン名
ko: 방식 이름
pt_br: Nome da esquema
zh_hans: 方案名称
zh_hant: 方案名稱

# 重命名方案
source: Rename scheme
es: Renombrar esquema
ja: プラン名を変更
ko: 방식 이름 변경
pt_br: Renomear esquema
zh_hans: 重命名方案
zh_hant: 重新命名方案

# 当前方案
source: Current scheme
es: Preajuste actual
ja: 現在のプラン
ko: 현재 방식
pt_br: Predefinição atual
zh_hans: 当前方案
zh_hant: 目前方案

# 切换与管理方案
source: Switch and manage schemes
es: Cambiar y gestionar esquemas
ja: プランの切り替えと管理
ko: 방식 전환 및 관리
pt_br: Alternar e gerenciar esquemas
zh_hans: 切换与管理方案
zh_hant: 切換與管理方案

# 搜索方案
source: Search schemes
es: Buscar esquemas
ja: プランを検索
ko: 방식 검색
pt_br: Buscar esquemas
zh_hans: 搜索方案
zh_hant: 搜尋方案

# 删除方案
source: Delete scheme
es: Eliminar esquema
ja: プランを削除
ko: 방식 삭제
pt_br: Excluir esquema
zh_hans: 删除方案
zh_hant: 刪除方案

# 保存当前规则后，方案会显示在这里。
source: Save the current rules to see your scheme here.
es: Guarda las reglas actuales para ver el esquema aquí.
ja: 現在のルールを保存すると、ここに表示されます。
ko: 현재 규칙을 저장하면 여기에 방식이 표시됩니다.
pt_br: Salve as regras atuais para ver a esquema aqui.
zh_hans: 保存当前规则后，方案会显示在这里。
zh_hant: 儲存目前規則後，方案會顯示在這裡。

# 新建方案
source: New scheme
es: Nuevo esquema
ja: 新規プラン
ko: 새 방식
pt_br: Nova esquema
zh_hans: 新建方案
zh_hant: 新增方案

# 另存为新方案…
source: Save as a new scheme…
es: Guardar como nuevo esquema…
ja: 新しいプランとして保存…
ko: 새 방식으로 저장…
pt_br: Salvar como nova esquema…
zh_hans: 另存为新方案…
zh_hant: 另存為新方案…

# 导入方案…
source: Import scheme…
es: Importar esquema…
ja: プランを読み込む…
ko: 방식 가져오기…
pt_br: Importar esquema…
zh_hans: 导入方案…
zh_hant: 導入方案…

# 导出方案…
source: Export scheme…
es: Exportar esquema…
ja: プランを書き出す…
ko: 방식 내보내기…
pt_br: Exportar esquema…
zh_hans: 导出方案…
zh_hant: 導出方案…

# 方案格式或版本不受支持。
source: Unsupported scheme format or version.
es: Formato o versión de esquema no compatible.
ja: プランの形式またはバージョンが未対応です。
ko: 지원하지 않는 방식 형식 또는 버전입니다.
pt_br: Formato ou versão da esquema não suportado.
zh_hans: 方案格式或版本不受支持。
zh_hant: 方案格式或版本不受支持。

# 为已有定位的图片写入城市数据
source: Add city data to geotagged photos
es: Añadir datos de ciudad a fotos con ubicación
ja: 位置情報のある写真に都市データを追加
ko: 위치가 있는 사진에 도시 데이터 추가
pt_br: Adicionar dados da cidade às fotos com localização
zh_hans: 为已有定位的图片写入城市数据
zh_hant: 為已有定位的圖片寫入城市資料

# 补齐省、市、区县等地区信息，可用于按城市重命名。
source: Fill in state, city and district details for renaming by city.
es: Completa provincia, ciudad y distrito para renombrar por ciudad.
ja: 都道府県・市区町村などを補完し、都市名で名前を変更できます。
ko: 시·도, 도시, 구·군 정보를 채워 도시별 이름 변경에 사용합니다.
pt_br: Preencha estado, cidade e distrito para renomear por cidade.
zh_hans: 补齐省、市、区县等地区信息，可用于按城市重命名。
zh_hant: 補齊省、市、區縣等地區資訊，可用於按城市重新命名。

# 补齐地区信息
source: Fill missing region details
es: Completar datos de región
ja: 不足する地域情報を補完
ko: 누락된 지역 정보 채우기
pt_br: Completar dados da região
zh_hans: 补齐地区信息
zh_hant: 補齊地區資訊

# 地区信息已暂存：%1$@ 张；查询失败：%2$@ 张；未补齐：%3$@ 张。请写入所有元数据。
source: Region details staged: %1$@; lookup failed: %2$@; unchanged: %3$@. Save all metadata.
es: Datos preparados: %1$@; consultas fallidas: %2$@; sin cambios: %3$@. Guarda todos los metadatos.
ja: 地域情報を保留：%1$@ 枚。検索失敗：%2$@ 枚。未補完：%3$@ 枚。すべてのメタデータを保存してください。
ko: 지역 정보 임시 저장: %1$@장, 조회 실패: %2$@장, 미완료: %3$@장. 모든 메타데이터를 저장하세요.
pt_br: Dados preparados: %1$@; consultas falharam: %2$@; sem alterações: %3$@. Salve todos os metadados.
zh_hans: 地区信息已暂存：%1$@ 张；查询失败：%2$@ 张；未补齐：%3$@ 张。请写入所有元数据。
zh_hant: 地區資訊已暫存：%1$@ 張；查詢失敗：%2$@ 張；未補齊：%3$@ 張。請寫入所有中繼資料。

# 保存定位时自动补齐地区信息
source: Fill region details automatically when saving location
es: Completar región al guardar la ubicación
ja: 位置情報の保存時に地域情報を自動補完
ko: 위치 저장 시 지역 정보 자동 채우기
pt_br: Completar região ao salvar a localização
zh_hans: 保存定位时自动补齐地区信息
zh_hant: 儲存定位時自動補齊地區資訊

# 包括省／州、市、区县、国家和国家代码；手动补齐不受此开关影响。
source: Includes state, city, district, country and country code. Manual filling works independently.
es: Incluye provincia, ciudad, distrito, país y código de país. El relleno manual es independiente.
ja: 都道府県、市区町村、国、国コードを含みます。手動補完はこの設定に影響されません。
ko: 시·도, 도시, 구·군, 국가 및 국가 코드를 포함합니다. 수동 채우기는 이 설정과 무관합니다.
pt_br: Inclui estado, cidade, distrito, país e código do país. O preenchimento manual é independente.
zh_hans: 包括省／州、市、区县、国家和国家代码；手动补齐不受此开关影响。
zh_hant: 包括省／州、市、區縣、國家和國家代碼；手動補齊不受此開關影響。

# 文件名示例
source: Example filename
es: Nombre de archivo de ejemplo
ja: ファイル名の例
ko: 파일 이름 예시
pt_br: Nome de arquivo de exemplo
zh_hans: 文件名示例
zh_hant: 檔案名稱範例

# 市＋拍摄时间
source: City + capture time
es: Ciudad + fecha de captura
ja: 都市＋撮影日時
ko: 도시＋촬영 시간
pt_br: Cidade + data de captura
zh_hans: 市＋拍摄时间
zh_hant: 市＋拍攝時間

# 数字编号＋原名
source: Number + original name
es: Número + nombre original
ja: 連番＋元の名前
ko: 번호＋원래 이름
pt_br: Número + nome original
zh_hans: 数字编号＋原名
zh_hant: 數字編號＋原名

# 拍摄时间＋设备型号
source: Capture time + camera model
es: Fecha de captura + modelo
ja: 撮影日時＋機種名
ko: 촬영 시간＋기기 모델
pt_br: Data de captura + modelo
zh_hans: 拍摄时间＋设备型号
zh_hant: 拍攝時間＋裝置型號

# 拍摄时间＋原名
source: Capture time + original name
es: Fecha de captura + nombre original
ja: 撮影日時＋元の名前
ko: 촬영 시간＋원래 이름
pt_br: Data de captura + nome original
zh_hans: 拍摄时间＋原名
zh_hant: 拍攝時間＋原名

# 自定义前缀＋编号
source: Custom prefix + number
es: Prefijo personalizado + número
ja: 任意の接頭辞＋連番
ko: 사용자 지정 접두사＋번호
pt_br: Prefixo personalizado + número
zh_hans: 自定义前缀＋编号
zh_hant: 自訂前綴＋編號

# 哈尔滨之旅
source: Harbin trip
es: Viaje a Harbin
ja: ハルビン旅行
ko: 하얼빈 여행
pt_br: Viagem a Harbin
zh_hans: 哈尔滨之旅
zh_hant: 哈爾濱之旅

# 同时保存两个页面的元数据？
source: Save metadata from both pages?
es: ¿Guardar los metadatos de ambas páginas?
ja: 両方のページのメタデータを保存しますか？
ko: 두 페이지의 메타데이터를 저장할까요?
pt_br: Salvar os metadados das duas páginas?
zh_hans: 同时保存两个页面的元数据？
zh_hant: 同時儲存兩個頁面的中繼資料？

# 保存当前页的元数据？
source: Save metadata from this page?
es: ¿Guardar los metadatos de esta página?
ja: このページのメタデータを保存しますか？
ko: 현재 페이지의 메타데이터를 저장할까요?
pt_br: Salvar os metadados desta página?
zh_hans: 保存当前页的元数据？
zh_hant: 儲存目前頁面的中繼資料？

# 只保存当前页的待保存修改，其他页修改保留。
source: Save only pending changes from this page. Changes on the other page remain pending.
es: Guarda solo los cambios de esta página; los de la otra quedan pendientes.
ja: このページの変更のみ保存し、他のページの変更は保留します。
ko: 현재 페이지의 변경만 저장하고 다른 페이지의 변경은 유지합니다.
pt_br: Salve apenas as alterações desta página; as da outra ficam pendentes.
zh_hans: 只保存当前页的待保存修改，其他页修改保留。
zh_hant: 只儲存目前頁面的待儲存修改，其他頁修改保留。

# 下次不再提示
source: Do not ask again
es: No volver a preguntar
ja: 次回から表示しない
ko: 다시 묻지 않기
pt_br: Não perguntar novamente
zh_hans: 下次不再提示
zh_hant: 下次不再提示

# 改为仅保存本页
source: Save only this page instead
es: Guardar solo esta página
ja: このページのみ保存に切り替える
ko: 이 페이지만 저장하도록 변경
pt_br: Salvar apenas esta página
zh_hans: 改为仅保存本页
zh_hant: 改為僅儲存本頁

# 保存按钮范围
source: Save button scope
es: Alcance del botón de guardar
ja: 保存ボタンの対象
ko: 저장 버튼 범위
pt_br: Escopo do botão de salvar
zh_hans: 保存按钮范围
zh_hant: 儲存按鈕範圍

# 写入当前页元数据
source: Save metadata from this page
es: Guardar metadatos de esta página
ja: 現在のページのメタデータを保存
ko: 현재 페이지 메타데이터 저장
pt_br: Salvar metadados desta página
zh_hans: 写入当前页元数据
zh_hant: 寫入目前頁面中繼資料

# 设备信息
source: Device information
es: Información del dispositivo
ja: 機器情報
ko: 기기 정보
pt_br: Informações do dispositivo
zh_hans: 设备信息
zh_hant: 裝置資訊

# 定位信息
source: Location information
es: Información de ubicación
ja: 位置情報
ko: 위치 정보
pt_br: Informações de localização
zh_hans: 定位信息
zh_hant: 定位資訊

# 自定义（通用标签）
source: Custom (general tags)
es: Personalizado (etiquetas generales)
ja: カスタム（汎用タグ）
ko: 사용자 지정(일반 태그)
pt_br: Personalizado (tags gerais)
zh_hans: 自定义（通用标签）
zh_hant: 自訂（通用標籤）

# 城市
source: City
es: Ciudad
ja: 都市
ko: 도시
pt_br: Cidade
zh_hans: 城市
zh_hant: 城市

# 区／县
source: District / county
es: Distrito / condado
ja: 区／郡
ko: 구／군
pt_br: Distrito / condado
zh_hans: 区／县
zh_hant: 區／縣

# 省／州
source: Province / state
es: Provincia / estado
ja: 都道府県／州
ko: 도／주
pt_br: Província / estado
zh_hans: 省／州
zh_hant: 省／州

# 设备序列号
source: Device serial number
es: Número de serie del dispositivo
ja: 機器のシリアル番号
ko: 기기 일련번호
pt_br: Número de série do dispositivo
zh_hans: 设备序列号
zh_hant: 裝置序號

# 国家
source: Country
es: País
ja: 国
ko: 국가
pt_br: País
zh_hans: 国家
zh_hant: 國家

# 国家代码
source: Country code
es: Código de país
ja: 国コード
ko: 국가 코드
pt_br: Código do país
zh_hans: 国家代码
zh_hant: 國家代碼

# 纬度
source: Latitude
es: Latitud
ja: 緯度
ko: 위도
zh_hans: 纬度
zh_hant: 緯度

# 经度
source: Longitude
es: Longitud
ja: 経度
ko: 경도
zh_hans: 经度
zh_hant: 經度

# %1$@ 张缺少定位 · %2$@ 张已有定位 · %3$@ 张缺少城市信息
source: %1$@ without location · %2$@ geotagged · %3$@ missing city data
es: %1$@ sin ubicación · %2$@ con ubicación · %3$@ sin ciudad
ja: 位置なし %1$@ 枚 · 位置あり %2$@ 枚 · 都市情報なし %3$@ 枚
ko: 위치 없음 %1$@장 · 위치 있음 %2$@장 · 도시 정보 없음 %3$@장
pt_br: %1$@ sem localização · %2$@ com localização · %3$@ sem cidade
zh_hans: %1$@ 张缺少定位 · %2$@ 张已有定位 · %3$@ 张缺少城市信息
zh_hant: %1$@ 張缺少定位 · %2$@ 張已有定位 · %3$@ 張缺少城市資訊

# 通常用于添加分隔符；完整文字请使用文字卡片。
source: Usually used for separators. Use a Text card for complete text.
es: Se usan normalmente para separadores. Para texto completo, usa una tarjeta de texto.
ja: 通常は区切り文字に使用します。まとまった文字列には文字カードを使用してください。
ko: 주로 구분 기호에 사용합니다. 완전한 문구는 텍스트 카드를 사용하세요.
pt_br: Normalmente usados para separadores. Para texto completo, use um cartão de texto.
zh_hans: 通常用于添加分隔符；完整文字请使用文字卡片。
zh_hant: 通常用於新增分隔符號；完整文字請使用文字卡片。

# 已显示
source: Visible
ja: 表示中
ko: 표시됨
pt_br: Visível
zh_hans: 已显示
zh_hant: 已顯示

# 手动查询
source: Manual
ja: 手動
ko: 수동
zh_hans: 手动查询
zh_hant: 手動查詢

# 通用
source: General
ja: 一般
ko: 일반
pt_br: Geral
zh_hans: 通用
zh_hant: 通用

# 手动
source: Manual
ja: 手動
ko: 수동
zh_hans: 手动
zh_hant: 手動

source: General
ja: 一般
ko: 일반
pt_br: Geral
zh_hans: 常规
zh_hant: 一般

# Metadata field: Flash
source: Flash
ja: ストロボ
ko: 플래시
zh_hans: 闪光
zh_hant: 閃光燈

# 正常
source: Normal
ja: 標準
ko: 보통
zh_hans: 正常
zh_hant: 正常

# Metadata field: LensMake
source: Lens Make
pt_br: Fabricante da lente
zh_hans: 镜头制造商
zh_hant: 鏡頭製造商

# 照片轨迹_生成%1$@_%2$@点_%3$@-%4$@.gpx
source: PhotoTrack_%1$@_%2$@points_%3$@-%4$@.gpx
zh_hans: 照片轨迹_生成%1$@_%2$@点_%3$@-%4$@.gpx
zh_hant: 照片軌跡_生成%1$@_%2$@點_%3$@-%4$@.gpx

# 高德地图
source: AMap
zh_hans: 高德地图
zh_hant: 高德地圖

# 高德地图（GCJ-02）
source: AMap (GCJ-02)
zh_hans: 高德地图（GCJ-02）
zh_hant: 高德地圖（GCJ-02）

# 高德密钥
source: AMap Key
zh_hans: 高德密钥
zh_hant: 高德密鑰
